In [206]:
import numpy as np
import pandas as pd

In [207]:
A= {
    'USN':[10,20,30,90,50],
    'Name':['Rajgupta','roni','Nveenn','Ismail','Rotn']
}

df1= pd.DataFrame(A)

In [208]:
df1

   USN      Name
0   10  Rajgupta
1   20      roni
2   30    Nveenn
3   90    Ismail
4   50      Rotn

In [209]:
B = {
    'USN' :[10,25,20,50,89],
    'Numbers':[256852,584,85648,5865,48545]
}

df2 = pd.DataFrame(B)

In [210]:
df2

   USN  Numbers
0   10   256852
1   25      584
2   20    85648
3   50     5865
4   89    48545

In [211]:
# inner join
df_i = pd.merge(df1,df2, how = 'inner',on = 'USN')

In [212]:
df_i

   USN      Name  Numbers
0   10  Rajgupta   256852
1   20      roni    85648
2   50      Rotn     5865

In [213]:
# left join
df_l = pd.merge(df1,df2, how = 'left',on = 'USN')

In [214]:
df_l

   USN      Name   Numbers
0   10  Rajgupta  256852.0
1   20      roni   85648.0
2   30    Nveenn       NaN
3   90    Ismail       NaN
4   50      Rotn    5865.0

In [215]:
# Rignt join
df_r = pd.merge(df1,df2, how = 'right',on = 'USN')

In [216]:
df_r

   USN      Name  Numbers
0   10  Rajgupta   256852
1   25       NaN      584
2   20      roni    85648
3   50      Rotn     5865
4   89       NaN    48545

In [220]:
#df1.join(df2)
df1.join(df2,lsuffix='_left', rsuffix='_right')

   USN_left      Name  USN_right  Numbers
0        10  Rajgupta         10   256852
1        20      roni         25      584
2        30    Nveenn         20    85648
3        90    Ismail         50     5865
4        50      Rotn         89    48545

In [221]:
df = pd.merge(df1, df2, on='USN', how='outer')

In [222]:
df

   USN      Name   Numbers
0   10  Rajgupta  256852.0
1   20      roni   85648.0
2   30    Nveenn       NaN
3   90    Ismail       NaN
4   50      Rotn    5865.0
5   25       NaN     584.0
6   89       NaN   48545.0